In [2]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.785250  1.010458
1  bar    one  2.549941  1.704677
2  foo    two -0.255153 -0.603249
3  bar  three -0.954625  0.117662
4  foo    two -0.548512  0.648127
5  bar    two -0.642762 -1.111568
6  foo    one  0.870697  0.556371
7  foo  three  0.839937  0.798669

In [5]:
grouped = df.groupby('A')

In [6]:
grouped.count()

     B  C  D
A
bar  3  3  3
foo  5  5  5

In [7]:
grouped = df.groupby(['A','B'])
grouped.count()

           C  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [9]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'
grouped = df.groupby(get_letter_type,axis = 1)
grouped.count().iloc[0]

a    1
b    3
Name: 0, dtype: int64

In [16]:
s = pd.Series([1,2,3,1,2,3],[8,7,5,8,7,5])
s

8    1
7    2
5    3
8    1
7    2
5    3
dtype: int64

In [17]:
grouped = s.groupby(level = 0)

In [18]:
grouped.first()

5    3
7    2
8    1
dtype: int64

In [19]:
grouped.last()

5    3
7    2
8    1
dtype: int64

In [20]:
grouped.sum()

5    6
7    4
8    2
dtype: int64

In [21]:
grouped = s.groupby(level = 0,sort =False)

In [22]:
grouped.first()

8    1
7    2
5    3
dtype: int64

In [24]:
df2 = pd.DataFrame({'X':['A','B','A','B'],'Y':[1,2,3,4]})
df2

   X  Y
0  A  1
1  B  2
2  A  3
3  B  4

In [25]:
df2.groupby(['X']).get_group('A')

   X  Y
0  A  1
2  A  3

In [26]:
df2.groupby(['X']).get_group('B')

   X  Y
1  B  2
3  B  4

In [27]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [29]:
index = pd.MultiIndex.from_arrays(arrays,names = ['first','second'])

In [30]:
s = pd.Series(np.random.randn(8),index = index)
s

first  second
bar    one      -0.877562
       two      -1.296007
baz    one       1.026419
       two       0.445126
foo    one       0.044509
       two       0.271037
qux    one      -1.686649
       two       0.914649
dtype: float64

In [31]:
grouped = s.groupby(level =0)
grouped.sum()

first
bar   -2.173569
baz    1.471545
foo    0.315545
qux   -0.772001
dtype: float64

In [32]:
grouped = s.groupby(level = 1)
grouped.sum()

second
one   -1.493284
two    0.334805
dtype: float64

In [36]:
grouped = s.groupby(level = 'first')
grouped.sum()

first
bar   -2.173569
baz    1.471545
foo    0.315545
qux   -0.772001
dtype: float64

In [37]:
df

     A      B         C         D
0  foo    one -0.785250  1.010458
1  bar    one  2.549941  1.704677
2  foo    two -0.255153 -0.603249
3  bar  three -0.954625  0.117662
4  foo    two -0.548512  0.648127
5  bar    two -0.642762 -1.111568
6  foo    one  0.870697  0.556371
7  foo  three  0.839937  0.798669

In [39]:
grouped = df.groupby(['A','B'])
grouped.aggregate(np.sum)

                  C         D
A   B
bar one    2.549941  1.704677
    three -0.954625  0.117662
    two   -0.642762 -1.111568
foo one    0.085447  1.566829
    three  0.839937  0.798669
    two   -0.803665  0.044878

In [40]:
grouped = df.groupby(['A','B'],as_index = False)
grouped.aggregate(np.sum)

     A      B         C         D
0  bar    one  2.549941  1.704677
1  bar  three -0.954625  0.117662
2  bar    two -0.642762 -1.111568
3  foo    one  0.085447  1.566829
4  foo  three  0.839937  0.798669
5  foo    two -0.803665  0.044878

In [43]:
df.groupby(['A','B']).sum().reset_index()

     A      B         C         D
0  bar    one  2.549941  1.704677
1  bar  three -0.954625  0.117662
2  bar    two -0.642762 -1.111568
3  foo    one  0.085447  1.566829
4  foo  three  0.839937  0.798669
5  foo    two -0.803665  0.044878

In [45]:
grouped = df.groupby(['A','B'])
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [46]:
grouped.describe().head()

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0  2.549941       NaN  2.549941  2.549941  2.549941  2.549941
    three   1.0 -0.954625       NaN -0.954625 -0.954625 -0.954625 -0.954625
    two     1.0 -0.642762       NaN -0.642762 -0.642762 -0.642762 -0.642762
foo one     2.0  0.042724  1.170932 -0.785250 -0.371263  0.042724  0.456710
    three   1.0  0.839937       NaN  0.839937  0.839937  0.839937  0.839937

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    2.549941   1.0  1.704677       NaN  1.704677  1.704677  1.704677
    three -0.954625   1.0  0.117662       NaN  0.117662  0.117662  0.117662
    two   -0.642762   1.0 -1.111568       NaN -1.111568 -1.111568 -1.111568
foo one    0.870697   2.0  0.783415  0.321089  0.556371  0.669893  0.783415
    three  0.839937   1.0  0.798669       NaN  0.798669  0.798669  0.798669


                75%       max
A   B
bar one    1.704677  1.704677
    three  0.117662  0.117662
    two   -1.111568 -1.111568
foo one    0.896936  1.010458
    three  0.798669  0.798669

In [47]:
grouped = df.groupby('A')
grouped['C'].agg([np.sum,np.mean,np.std])

          sum      mean       std
A
bar  0.952553  0.317518  1.939613
foo  0.121719  0.024344  0.781542

In [49]:
grouped['C'].agg({'res_sum':np.sum,'res_mean':np.mean,'res_std':np.std})

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  if __name__ == '__main__':

      res_std  res_mean   res_sum
A
bar  1.939613  0.317518  0.952553
foo  0.781542  0.024344  0.121719